; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob55) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate10)
	(at pallet2 depot2)
	(clear crate2)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 depot0)
	(clear crate12)
	(at pallet7 depot1)
	(clear crate8)
	(at pallet8 depot2)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear crate9)
	(at pallet10 depot0)
	(clear crate11)
	(at pallet11 depot1)
	(clear crate0)
	(at pallet12 distributor2)
	(clear crate3)
	(at truck0 distributor0)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 depot2)
	(available hoist7)
	(at hoist8 depot0)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at crate0 depot1)
	(on crate0 pallet11)
	(at crate1 depot1)
	(on crate1 pallet1)
	(at crate2 depot2)
	(on crate2 pallet2)
	(at crate3 distributor2)
	(on crate3 pallet12)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(at crate5 depot1)
	(on crate5 pallet7)
	(at crate6 distributor0)
	(on crate6 crate4)
	(at crate7 depot1)
	(on crate7 crate1)
	(at crate8 depot1)
	(on crate8 crate5)
	(at crate9 distributor1)
	(on crate9 pallet9)
	(at crate10 depot1)
	(on crate10 crate7)
	(at crate11 depot0)
	(on crate11 pallet10)
	(at crate12 depot0)
	(on crate12 pallet6)
)

(:goal (and
		(on crate0 pallet3)
		(on crate1 pallet7)
		(on crate2 pallet8)
		(on crate3 pallet12)
		(on crate4 pallet9)
		(on crate6 pallet5)
		(on crate7 pallet11)
		(on crate8 pallet4)
		(on crate9 crate2)
		(on crate10 pallet2)
		(on crate11 pallet0)
		(on crate12 crate3)
	)
))

; plan
1. (lift hoist8 crate11 pallet10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist8) (on crate11 pallet10)
   added: (lifting hoist8 crate11) (clear pallet10)
   goals met: 1 of 12
2. (drop hoist8 crate11 pallet0 depot0)
   deleted: (lifting hoist8 crate11) (clear pallet0)
   added: (available hoist8) (at crate11 depot0) (clear crate11) (on crate11 pallet0)
   goals met: 2 of 12
3. (lift hoist8 crate12 pallet6 depot0)
   deleted: (at crate12 depot0) (clear crate12) (available hoist8) (on crate12 pallet6)
   added: (lifting hoist8 crate12) (clear pallet6)
   goals met: 2 of 12
4. (lift hoist9 crate6 crate4 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist9) (on crate6 crate4)
   added: (lifting hoist9 crate6) (clear crate4)
   goals met: 2 of 12
5. (load hoist9 crate6 truck0 distributor0)
   deleted: (lifting hoist9 crate6)
   added: (in crate6 truck0) (available hoist9)
   goals met: 2 of 12
6. (lift hoist9 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist9) (on crate4 pallet3)
   added: (lifting hoist9 crate4) (clear pallet3)
   goals met: 2 of 12
7. (load hoist9 crate4 truck0 distributor0)
   deleted: (lifting hoist9 crate4)
   added: (in crate4 truck0) (available hoist9)
   goals met: 2 of 12
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 2 of 12
9. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 2 of 12
10. (lift hoist7 crate2 pallet2 depot2)
   deleted: (at crate2 depot2) (clear crate2) (available hoist7) (on crate2 pallet2)
   added: (lifting hoist7 crate2) (clear pallet2)
   goals met: 2 of 12
11. (drop hoist7 crate2 pallet8 depot2)
   deleted: (lifting hoist7 crate2) (clear pallet8)
   added: (available hoist7) (at crate2 depot2) (clear crate2) (on crate2 pallet8)
   goals met: 3 of 12
12. (lift hoist4 crate9 pallet9 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 pallet9)
   added: (lifting hoist4 crate9) (clear pallet9)
   goals met: 3 of 12
13. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   goals met: 3 of 12
14. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 3 of 12
15. (load hoist8 crate12 truck0 depot0)
   deleted: (lifting hoist8 crate12)
   added: (in crate12 truck0) (available hoist8)
   goals met: 3 of 12
16. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 3 of 12
17. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 3 of 12
18. (unload hoist5 crate12 truck0 distributor2)
   deleted: (in crate12 truck0) (available hoist5)
   added: (lifting hoist5 crate12)
   goals met: 3 of 12
19. (drop hoist5 crate12 crate3 distributor2)
   deleted: (lifting hoist5 crate12) (clear crate3)
   added: (available hoist5) (at crate12 distributor2) (clear crate12) (on crate12 crate3)
   goals met: 4 of 12
20. (unload hoist5 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 4 of 12
21. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   goals met: 4 of 12
22. (unload hoist7 crate9 truck0 depot2)
   deleted: (in crate9 truck0) (available hoist7)
   added: (lifting hoist7 crate9)
   goals met: 4 of 12
23. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 4 of 12
24. (drop hoist5 crate6 pallet5 distributor2)
   deleted: (lifting hoist5 crate6) (clear pallet5)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 pallet5)
   goals met: 5 of 12
25. (drop hoist7 crate9 crate2 depot2)
   deleted: (lifting hoist7 crate9) (clear crate2)
   added: (available hoist7) (at crate9 depot2) (clear crate9) (on crate9 crate2)
   goals met: 6 of 12
26. (unload hoist4 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist4)
   added: (lifting hoist4 crate4)
   goals met: 6 of 12
27. (drop hoist4 crate4 pallet9 distributor1)
   deleted: (lifting hoist4 crate4) (clear pallet9)
   added: (available hoist4) (at crate4 distributor1) (clear crate4) (on crate4 pallet9)
   goals met: 7 of 12
28. (lift hoist1 crate10 crate7 depot1)
   deleted: (at crate10 depot1) (clear crate10) (available hoist1) (on crate10 crate7)
   added: (lifting hoist1 crate10) (clear crate7)
   goals met: 7 of 12
29. (load hoist1 crate10 truck1 depot1)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   goals met: 7 of 12
30. (drive truck1 depot1 depot2)
   deleted: (at truck1 depot1)
   added: (at truck1 depot2)
   goals met: 7 of 12
31. (unload hoist7 crate10 truck1 depot2)
   deleted: (in crate10 truck1) (available hoist7)
   added: (lifting hoist7 crate10)
   goals met: 7 of 12
32. (drop hoist7 crate10 pallet2 depot2)
   deleted: (lifting hoist7 crate10) (clear pallet2)
   added: (available hoist7) (at crate10 depot2) (clear crate10) (on crate10 pallet2)
   goals met: 8 of 12
33. (lift hoist1 crate0 pallet11 depot1)
   deleted: (at crate0 depot1) (clear crate0) (available hoist1) (on crate0 pallet11)
   added: (lifting hoist1 crate0) (clear pallet11)
   goals met: 8 of 12
34. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 8 of 12
35. (load hoist1 crate0 truck0 depot1)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   goals met: 8 of 12
36. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 8 of 12
37. (unload hoist9 crate0 truck0 distributor0)
   deleted: (in crate0 truck0) (available hoist9)
   added: (lifting hoist9 crate0)
   goals met: 8 of 12
38. (drop hoist9 crate0 pallet3 distributor0)
   deleted: (lifting hoist9 crate0) (clear pallet3)
   added: (available hoist9) (at crate0 distributor0) (clear crate0) (on crate0 pallet3)
   goals met: 9 of 12
39. (lift hoist1 crate7 crate1 depot1)
   deleted: (at crate7 depot1) (clear crate7) (available hoist1) (on crate7 crate1)
   added: (lifting hoist1 crate7) (clear crate1)
   goals met: 9 of 12
40. (drop hoist1 crate7 pallet11 depot1)
   deleted: (lifting hoist1 crate7) (clear pallet11)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 pallet11)
   goals met: 10 of 12
41. (lift hoist1 crate8 crate5 depot1)
   deleted: (at crate8 depot1) (clear crate8) (available hoist1) (on crate8 crate5)
   added: (lifting hoist1 crate8) (clear crate5)
   goals met: 10 of 12
42. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 10 of 12
43. (load hoist1 crate8 truck0 depot1)
   deleted: (lifting hoist1 crate8)
   added: (in crate8 truck0) (available hoist1)
   goals met: 10 of 12
44. (lift hoist1 crate1 pallet1 depot1)
   deleted: (at crate1 depot1) (clear crate1) (available hoist1) (on crate1 pallet1)
   added: (lifting hoist1 crate1) (clear pallet1)
   goals met: 10 of 12
45. (load hoist1 crate1 truck0 depot1)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 10 of 12
46. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 10 of 12
47. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   goals met: 10 of 12
48. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 10 of 12
49. (drop hoist4 crate8 pallet4 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet4)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet4)
   goals met: 11 of 12
50. (lift hoist1 crate5 pallet7 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet7)
   added: (lifting hoist1 crate5) (clear pallet7)
   goals met: 11 of 12
51. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 11 of 12
52. (unload hoist1 crate1 truck0 depot1)
   deleted: (in crate1 truck0) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 11 of 12
53. (drop hoist1 crate1 pallet7 depot1)
   deleted: (lifting hoist1 crate1) (clear pallet7)
   added: (available hoist1) (at crate1 depot1) (clear crate1) (on crate1 pallet7)
   goals met: 12 of 12
